/* Default value */
" (default)" = " (default)";

/* Command placeholder */
"<command>" = "<command>";

/* Subcommand placeholder */
"<subcommand>" = "<subcommand>";

/* Description */
"Arguments" = "Arguments";

/* Error message */
"Internal error. Invalid state while parsing command-line arguments." = "Internal error. Invalid state while parsing command-line arguments.";

/* Error message */
"Internal error. Parsing command-line arguments hit unimplemented code path." = "Internal error. Parsing command-line arguments hit unimplemented code path.";

/* Error message */
"Missing expected argument" = "Missing expected argument";

/* Error message */
"Missing required subcommand." = "Missing required subcommand.";

/* Description */
"Options" = "Options";

/* Help text */
"Show help information." = "Show help information.";

/* Help text */
"Show the version." = "Show the version.";

/* Description */
"Subcommands" = "Subcommands";

/* Error message */
"Unspecified version" = "Unspecified version";

/* Placeholder */
"value" = "value";

/* Default value */
"(default: %@)" = "(default: %@)";

/* Usage help */
"Usage: %@" = "Usage: %@";

/* Abstract */
"OVERVIEW: %@" = "OVERVIEW: %@";

/* Help text */
"

  See '%@ <subcommand>' for detailed help.
" = "

  See '%@ <subcommand>' for detailed help.
";

/* Help text */
"
%1$@\
USAGE: %2$@

%3$@%4$@
" = "
%1$@\
USAGE: %2$@

%3$@%4$@
";

/* Help text */
"\n  See '%@ --help' for more information." = "\n  See '%@ --help' for more information.";

/* Command options help */
"%@ <options>" = "%@ <options>";

/* Error message */
"Invalid option: %@" = "Invalid option: %@";

/* Error message */
"Invalid option: -%@" = "Invalid option: -%@";

/* Error message */
"Internal error. Parsing command-line arguments hit unimplemented code path." = "Internal error. Parsing command-line arguments hit unimplemented code path.";

/* Error message */
"Internal error. Invalid state while parsing command-line arguments." = "Internal error. Invalid state while parsing command-line arguments.";

/* Error message */
"
Can't autodetect a supported shell.
Please use --generate-completion-script=<shell> with one of:
    %@
" = "
Can't autodetect a supported shell.
Please use --generate-completion-script=<shell> with one of:
    %@
";

/* Error message */
"
Can't generate completion scripts for '%@'.
Please use --generate-completion-script=<shell> with one of:
    %@
" = "
Can't generate completion scripts for '%@'.
Please use --generate-completion-script=<shell> with one of:
    %@
";

/* Error message */
"Unknown option '%@'." = "Unknown option '%@'.";

/* Error message */
"Unknown option '%1$@'. Did you mean '%2$@'?" = "Unknown option '%1$@'. Did you mean '%2$@'?";

/* Error message */
"Missing value for '%1$@ <%2$@>'" = "Missing value for '%1$@ <%2$@>'";

/* Error message */
"The option '1$%@' does not take any value, but '%2$@' was specified." = "The option '1$%@' does not take any value, but '%2$@' was specified.";

/* Error message */
"Unexpected argument '%@'" = "Unexpected argument '%@'";

/* Error message */
"%1$@ unexpected arguments: '%2$@'" = "%1$@ unexpected arguments: '%2$@'";

/* Position message */
"position %@" = "position %@";

/* Error message, uses above string as argument */
"Value to be set with %1$@ had already been set with %2$@" = "Value to be set with %1$@ had already been set with %2$@";

/* Error message */
"Missing expected argument '%@'" = "Missing expected argument '%@'";

/* Error message */
"Missing one of: '%@'" = "Missing one of: '%@'";

/* Error message */
"The value '%1$@' is invalid for '%2$@ <%3$@>'%4$@" = "The value '%1$@' is invalid for '%2$@ <%3$@>'%4$@";

/* Error message */
"The value '%1$@' is invalid for '<%2$@>'%3$@" = "The value '%1$@' is invalid for '<%2$@>'%3$@";

/* Error message */
"The value '%1$@' is invalid for '%2$@'%3$@" = "The value '%1$@' is invalid for '%2$@'%3$@";

/* Error message */
"The value '%1$@' is invalid.%2$@" = "The value '%1$@' is invalid.%2$@";
